node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "global_step"
    }
  }
}
node {
  name: "global_step/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/Assign"
  op: "AssignVariableOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond"
  op: "If"
  input: "global_step/VarIsInitializedOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "Tcond"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tin"
    value {
      list {
        type: DT_RESOURCE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_lower_using_switch_merge"
    value {
      b: true
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "else_branch"
    value {
      func {
        name: "global_step_cond_false_24013"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "then_branch"
    value {
      func {
        name: "global_step_cond_true_24012"
      }
    }
  }
}
node {
  name: "global_step/cond/Identity"
  op: "Identity"
  input: "global_step/cond"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "AddV2"
  input: "global_step/cond/Identity"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "normalize_element/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 6014
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 6014
          }
        }
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
        string_val: "acept"
        string_val: "not acept"
        string_val: "acept"
